import React, { Component } from "react";
import logo from "./logo.svg";
import "./App.css";

class App extends Component {
  render() {
    return (
      <div className="App">
        <header className="App-header">
          <img src={logo} className="App-logo" alt="logo" />
          <p className="test">
            BCT 개인보호정책
            <br />
            <br /> 개인정보 수집 및 이용에 대한 동의(필수)
            <br />
            고객님께서는 개인정보 수집/이용에 대한 동의를 거부하실 수 있으며, 거부 시에는 회원가입에 제한을 받을 수 있습니다. 
            <br />
            <br />
            <br />
            개인정보의 이용목적 및 수집항목
            <br />
            <br />
             BCT(이하 ‘회사’)은 홈페이지 및 모바일을 통하여 고객의 개인정보를 다음의 목적을 위해 수집, 이용합니다.
            <br />
            <br />
            <br />
            <br />
            1. 회원가입 및 관리
            <br />
            <br />
            가) 국내 이용자의 경우 ①이름, ②연락처, ③이메일 주소,④BCT Wallet 메인지갑 주소, ⑤BCT Wallet 보너스 지갑 주소, ⑥보내는 분의 전자지갑 주소를 수집합니다.
            <br />
            나) 해외 이용자의 경우 ①이름, ②연락처, ③이메일 주소,④BCT Wallet 메인지갑 주소, ⑤BCT Wallet 보너스 지갑 주소, ⑥보내는 분의 전자지갑 주소를 수집합니다.
            <br />
            <br />
            <br />
            <br />
            2. 서비스 이용 과정에서의 수집
            <br />
            <br />
            가) 서비스 이용 과정에서 접속정보(이용대상 국가, 기종, 브라우져, 접속IP, 일시)가 수집됩니다.
            <br />
            <br />
            <br />
            <br />
            3. 면책사항
            <br />
            <br />
            회사는 개인정보 누설, 유출 등을 미연에 방지하고, 개인정보의 안전을 지키기 위해 만전을 기하고 있으나 이것이 정보의 안전성을 완벽하게 보장한다는 의미는 아닙니다.
            <br />
            <br />
            또한, 본 서비스 이용은 회원의 전 책임하에 제공되는 것으로, 개인 정보의 누설, 유출 등에 의하여 발생하는 손실과 손해에 관하여 회사는 일절 책임을 지지 않습니다.
            <br />
            <br />
            특히, 개인 키 (Private key)의 분실이나 유출로 인해 일어나는 문제에 관하여 회사는 어떠한 책임도 지지 않습니다. 개인 키(Private key)는 본인만 알 수 있는 안전한 곳에 보관하기를 권고해 드립니다.
            <br />
            <br />
            <br />
            <br />
            <br />
              개인정보의 보유 및 이용기간
            <br />
            <br />
             회사는 개인정보의 수집 및 이용목적이 달성된 후, 또는 회원탈퇴 시 지체 없이 파기 처리합니다. 단, 관계법령의 규정에 의하여 보존할 필요성이 있는 경우 회사는 관계법령에서 지시하는 일정기간동안 개인정보를 보관합니다.
            <br />
            <br />
            - 계약 또는 청약철회 등에 관한 기록: 5년
            <br />
            <br />
            - 대금결제 및 재화 등의 공급에 관한 기록: 5년
            <br />
            <br />
            - 소비자의 불만 또는 분쟁처리에 관한 기록: 3년
            <br />
            <br />
            - 통신비밀보호법 로그인 기록 : 3개월
          </p>
        </header>
      </div>
    );
  }
}

export default App;
